[{"steal":"Pebble, Fire Stone, Potion","level":"Level 1","name":"Rogue Tomato","strategy":" Exit out to the Eastersands and you should see it straight out on a cliff   "},{"steal":"Pebble, Potion, Wolf Pelt","level":"Level 3 - Recommended 6+","name":"Thextera","strategy":" Exit out of Rabanastre to the Westersands, you should find it to the SE   "},{"steal":"Cactus Fruit, Earth Stone, Potion","level":"Level 4 - Recommended 6+(Not solo)","name":"Flowering Cactoid","strategy":" Dalmasca Westersands\/Galtea Downs  Exit to the east to Yardang Labyrinth from the little camp in the eastersands where you meet Dantro, the client for this hunt.  You should find it near the center.   "},{"steal":"Glass Jewel, Dark Magicite, Hi-Potion","level":"Level 8 - Recommended 10+","name":"Wraith","strategy":" Garamsythe Waterway\/Overflow Cloaca  Go to where Kite had let you down into the sewers before and this time take the right door(only one you can).  Go down to the middle of the room where you killed rats at the start of the game and it'll spawn   "},{"steal":"Potion, Small Feather, Large Feather","level":"Level 8\/9 - Recommended 18+","name":"Cluckatrice","strategy":" Giza Plains\/Gizas North Bank  Talk to the client in the cockatrice pen and she'll tell you that Cluckitrice appears in \"Gizas North Bank\" but it's shy and won't come out if there are monsters about.  Press \"Select\" to bring up the map and use the D-pad to find the area that is named \"Gizas North Bank\"(It's the one to the east).  Now just go there and kill everything, exit the North Bank area and re-enter and it will have spawned.  This can only be done during the Dry which isn't a problem if you do this when you first can.  Later on it will periodically change from rainy to dry.  You can talk to a seeq at the south exit that will tell you how close the weather is to changing(you can also see whether it's rainy or dry by looking out from the south exit).  Some people say it changes hourly.   "},{"steal":"Antidote, Tanned Hide, Aries Gem","level":"Level 11 - Recommended 18+","name":"Nidhogg","strategy":" Lhusu Mines\/Transitway 1  The giant snake is right at the split in the tracks.  As long as you don't take the little hallway on the side you can't miss it...   "},{"steal":"Potion, Turtle Shell, Aged Turtle Shell","level":"Level 11 - Recommended 18+","name":"Rocktoise","strategy":" Lhusu Mines\/Site 2  It's in the area where you had the scene with Ba'Gamnan   "},{"steal":"Yensa Scale, Crooked Fang, Wyvern Wing","level":"Level 14\/15 - Recommended 20+","name":"Wyvern Lord","strategy":" Nam-Yensa Sandsea\/Simoon Bluff  Go to the very north and you can find it flying back and forth just off the cliffside.   "},{"steal":"Horn, Pointed Horn, Aries Gem","level":"Level 16 - Recommended 25+","name":"Croakadile","strategy":" Giza Plains\/Starfall Field  Must be during the rains.  Appears just across the bridge by the sunstone.  Return to the man who is at Nomad Village during the rains for the Hunt reward and you can give the ring to the Elder at Nomad Village during the Dry   "},{"steal":"Potion, Earth Magicite, Slaven Harness","level":"Level 17 - Recommended 25+","name":"Enkelados","strategy":" Ozmone Plains\/The Shred  Northern Part. Kill all and then reenter. Watchout for Bull Croc(and Aeros) if it's there as well  "},{"steal":"Phoenix Down, Hi-Potion, Water Magicite","level":"Level 16\/17 - Recommended 30+","name":"Ring Wyrm","strategy":" Dalmasca Westersands\/Windtrace Dunes, SW part.  Easiest way is to warp to Dalmasca Westersands and exit out east and you should see him to the south.  There needs to be a sandstorm.  As far as getting a sandstorm exit out of the westersands and go back in till there is one.  It's best to do this before earth tyrant since it seems to be infinitely harder to get a sandstorm after defeating it.  With earth tyrant you can force a sandstorm by entering his area in the NE of the eastersands(Wyrm's next IIRC).   "},{"steal":"1000 gil, 2000 gil, 4000 gil","level":"Level 17 - Recommended 30+","name":"Gil Snapper","strategy":" You can only find the client during the Rains at the \"Crystal Glade\".  Talk to her and she'll tell you that you can find it in \"Tracks of the Beast\" but you need to find a way to cross over to it.  If you look up from her you'll see a dead withered tree.  Examine it and you should get the option to chop it down and do so.  You'll need to find 5 more which can be found in the following places in Giza Plains during the Rains, for completeness in case someone doesn't read or skips over the part about the one by the client I'll list it first:  Crystal Glade Starfall Field Toam Hills Nomad Village Gizas North Bank Throne Road  After you can cross to \"Tracks of the Beast\" from \"Gizas South Bank\".  You'll find Bansat from Clan Centurio there to help.  Pay attention to what he says as he'll tell you when Gil Snapper is up.  If he says that the mark isn't up just exit and reenter \"Tracks of the Beast\" until he does.  If you have to exit out for some reason after engaging and come back later I don't believe he will say.  You'll have to exit\/reenter until you get a very, very stormy atmosphere.  After killing it you can meet them in Nomad Village when it's Dry. From what I can tell the weather won't start changing until sometime after you advance the story.  Try after Henne mines or stilshrine.   "},{"steal":"Potion, Echo Herbs, Hi-Potion","level":"Level 17 - Recommended 30+","name":"White Mousse","strategy":" Garamsythe Waterway\/West Sluice Control    From the save point(Central Waterway Control, second room in after entering) take the a WEST exit to WEST No. 10 channel.  (Note that both the east and west rooms are both called No. 10 channel, you need to go to the west side). When you enter the west area you will see that the mini-map shows that the upper paths connect unlike the area map.  Staying on the upper path, use the connecting little connecting stairs to make you're way over and down to West Sluice Control.  If you need to check out the video at the end of the strategy or search youtube.  There are several vids by others on there that show how to get to him.  Alternate just try every exit till you find one that is not flooded, by default all other areas BUT the west No. 10 channel are flooded so by the process of elimination you'll find the only way you can go and must go.   "},{"steal":"Phoenix Down, Caramel, Slime Oil","level":"Level 17 - Recommended 30+","name":"Orthros","strategy":" Garamsythe Waterway\/Southern Sluiceway.  It's the room to the right of the one where you find White Mousse.  You do not have to mess with any of the water controls.  You need a team of Ashe, Fran and Penelo for it to spawn but you can immediately switch them out afterwards.  There is a handy save crystal at East Sluice Control which is the room just to the right   "},{"steal":"Fire Stone, Prime Tanned Hide, Fire Crystal","level":"Level 17 - Recommended 30+","name":"Marilith","strategy":" Zertinan Caverns\/Invitation to Heresy  Make sure you talk to the client first.  Go to the Westersands and go to \"Shimmering Horizons\" and exit to Zertinan Caverns by taking the SW exit. You'll be in \"Invitation to Heresy\" which is the right part of the Caverns. He appears in the S part of the cave where there are usually a -couple frogs- walking around.  You should notice in the back there are several windows letting in light.  This is the largest room in the area. That's where it spawns however you usually have to wait around five minutes before it will come out. Just run around killing things in the meantime or simply loiter around there. Eventually it'll pop up when you walk all the way into the corner where the light is shining.   "},{"steal":"Dark Crystal, Book of Orgain-Mille, Flame Shield","name":"Ixtab","strategy":" Eastern corner of Phase 1 Shaft in Henne Mines.  Need to hit the switch at Pithead-Junction A to access that section of it.  At the map urn   "},{"steal":"Pebble, Quality Pelt, Prime Pelt","name":"Feral Retriever","strategy":" Paramina Rift\/Spine of the Icewyrm.  It's just to the left of the area with a save crystal and on the way to Stilshrine   "},{"steal":"Chocobo Feather, Gysahl Greens, Hastega Mote","name":"Trickster","strategy":" The area to find it is Frozen brook 2 screens south of Bur-Omisace. This is like Gil Snapper.  The first time you enter and it's there the guy from Clan Centurio will tell you.  If you exit the area and come back he won't tell you when it's there again so you'll just have to exit and reenter till it's there. You will probably want to venture in some to check it out as it can be semi-invisible(you can still see it's outline) but it will run around all over the frozen bank and most likely run into you.  Tip: Trickster can be defeated with bio while he is using white wind or paling.  (Thank you to Ramon for submitting this tip!)   "},{"steal":"Potion, Charger Barding, Cancer Gem","name":"Antlion","strategy":"  Talk to the client to get the Site 3 key.  Go to the area where you fought Rocktoise and you can use the key to open the gate.  Head toward the south and west, your goal is Site 9.  There is a handy gate crystal on the way.   "},{"steal":"Drab Wool, Hi-Potion, Blood Wool","level":"Level 23 - Recommended 30+","name":"Vorpal Bunny","strategy":"  You can find this mark at Golmore Jungle\/The Rustling Chapel.  It's sometimes hidden like some bunnies are and will pop out when you get near.   "},{"steal":"Potion, Tanned Giantskin, Gemini Gem","level":"Level 24 - Recommended 25+","name":"Atomos","strategy":"  Mosphoran Highwaste\/Northern Skirts, Northern part   "},{"steal":"Pebble, Float Mote, Vanishga Mote","level":"Level 23 - Recommended 30+","name":"MindFlayer","strategy":"  Henne Mines\/Phase 1 Dig    SE corner, must have full MP when you enter the area.  Note that it's Phase 1 Dig and NOT Phase 1 >Shaft<   "},{"steal":"Pebble, Bat Fang, Spiral Incisor","level":"Level 24 - Recommended 35+","name":"Bloodwing","strategy":"  Barhiem Passage\/West Annex  Inorder to get to this mark you need the Barhiem Key.  Getting it involves helping Dantro's wife in South Bank village heal a patient.  Search an faq for the sidequest.  Once you have it you can enter Barhiem from it's other entrance just south east of South Bank Village(South Bank Village south to Banks of the Nebra south east to Murmuring Defile). Inside head north to Great Central Passage and take the NW exit to the East-West Bypass. Head on to The Zeviah Span where you need to find a rail car off to the side to interact with to make your way south once you reach a dead-end(it's on the rightside at the center dead-end if facing south).  Continue on to West Annex. It'll spawn in the middle of the narrow part to the south.  These is a save point in the room to the west of West Annex  "},{"steal":"Storm Magicite, Storm Crystal, Grimoire Aidhed","level":"Level 24 - Recommended 25+","name":"Braegh","strategy":"  Salikawood\/Corridor of Ages  By SW exit   "},{"steal":"Dark Crystal, Foul Liquid, Putrid Liquid","level":"Level 24 - Recommended 45+","name":"Carrot","strategy":"  Salikawood\/Sun-Dappled path  Don't kill anything, anywhere upon entering Salikawood until you get to the mark. The vierra from the clan should then tell you carrot is nearby.  When I say don't kill anything, anywhere from when you enter Salikawood till you get to Sun-Dappled path I mean don't kill anything in anyother part of Salikawood and not just Sun-Dappled path.  Sorry but that needed to be repeated  "},{"steal":"Fire Stone, Iron Ore, Fire Crystal","level":"Level 24 - Recommended 50+","name":"Roblon","strategy":"  Nabreus Deadlands\/Overlooking Eternity  Take the far north exit in Salikawood to reach the Nabreus Deadlands. Secret path is found in The Slumbermead at the NW which leads to The Fog Mutters and onto Overlooking Eternity.   "},{"steal":"Eye drops, Aged Turtle Shell, Ancient Turtle shell","level":"Level 24 - Recommended 30+","name":"Darksteel","strategy":"  Sochen Cave Palace\/Temptation Eluded   "},{"steal":"Spiral Incisor, Charging Barding, Leo Gem","level":"Level 25 - Recommended 40+","name":"Vyraal","strategy":"  Cerobi Steppe\/The Northsward  Exit out Balfonhiem to Cerobi Steppes and keep going up(NE) from when you enter cerobi steppes   "},{"steal":"Pebble, Ring wyrm scale, Ring wyrm liver","level":"Level 25 - Recommended 45+","name":"Lindwyrm","strategy":"  Tchita Uplands\/Garden of Life's Circle  Someone made an error translating it as it is certainly not found in the highlands part of the map and if you look at it a different way it is also the lowest part.  Anyway Tchita Uplands must be cloudy(no rain) for Lyndwyrm to be there.  You have to exit out of Tchita completly to change the weather either by exiting in and out from Phon Coast\/Cerobi Steppes.  Reloading the game does not seem to change the weather  Please note that cloudy means cloudy and not partly cloudy  "},{"steal":"Forbidden Flesh, Fire Crystal, Gemini Gem","level":"Level 25 - Recommended 40+","name":"Overlord","strategy":"  Sochen Cave Palace\/Doubt Abandoned  Quickest from the Tchita gate crystal   "},{"steal":"Elixir, Dark Matter","level":"Level 25 - Recommended 45+","name":"Belito","strategy":"  Nam-Yensa Sandsea\/Withering Shores  It's the deadend part of Withering shores that you can only get to by going through Zertinan caverns.  Enter Zertinan caves through the entrance in Ogir-Yensa Sandsea\/Central Junction.  You'll be in Canopy of Clay.  Take the NW exit in Canopy of Clay to Nam-Yensa Sandsea\/Withering shores and head to the end of the dead end to spawn them.    Technically you can get there from any Zertinan Cavern entrance but that's the easiest.   "},{"steal":"Holy magicite, Iron Ore, Holy Crystal","level":"Level 25 - Recommended 45+","name":"Goliath","strategy":"  Necrohol of Nabudis\/Hall of Slumbering Might  Near the entrance to Nabudis from Nabreus Deadlands   "},{"steal":"Book of Orgain-Mille, Book of Orgain, Capricorn gem","level":"Level 25- Recommended 45+","name":"Deathscythe","strategy":"  Necrohol of Nabudis\/Cloister of the Highborn  Bring a person's HP down to <10% when on Cloister of the Highborn and it will appear.   "},{"steal":"Wolf Pelt, Beastlord Hide, Throat Wolf Blood","level":"Level 35- Recommended 40+","name":"Gilgamesh Part 1","strategy":"  Lhusu Mines\/Tasche Span  You need to complete the Antlion quest in order to gain access to the area and for the Hunt to be listed. Tasche spawn is just west of the gate crystal.   "},{"steal":"Wolf Pelt, Beastlord Hide, Hell-Gates Flame","level":"Level 35 - Recommended 60+","name":"Gilgamesh Part 2","strategy":"  Lhusu Mines\/Site 7  You need the Site 11 key which the kid you saved during the Antlion hunt dropped into the sea.  Go to Phon Coast and at the Hunter's Camp(the area with the gate crystal and all the people) you can find a fallen Bhujerban in the northwest part.  Check the shiny object near him for the key.  You can then use the key to open the gate in the W part of Site 9. In site 11 look for a device to open the gate in NW and then proceed on. In Site 5 head directly east to make it to Site 6 South and then head south to make it to the aptly named Staging Area where you can save.  Just south of the save point is Site 7 and Gilgamesh.   "},{"steal":"Phoenix Down, Charger Barding, Emperor Scale","level":"Level 25 - Recommended 50+","name":"Deathgaze","strategy":"  Airship  You should be able to find the client in any Aerodome.  It's the son of the traveling family.  What you have to do to find it is ride an airship and then talk to the boy again.  Each time he'll tell you it's getting closer and closer.  By talking to him between flights your chance of fighting deathgaze increases.  It'll still be random whether you get the option to fight it, if not just keep taking airships and talking to the boy. Choose to fight it and then run up onto the deck. *You do not have to check yourself, the option to fight it will come in place of the usual greeting when the ship loads up* Taking the leisure craft is how I did as I did the chief steward(The Seven Sisters) sidequest at the same time but private works just the same.   "},{"steal":"Fire Crystal, Demon's Sigh, Scorpio Gem","level":"Level 25 - Recommended 50+","name":"Diabolos","strategy":"  Lhusu Mines\/Site 11  He's at the SW corner of Site 11  If you haven't done gilg part 2 and haven't gotten the site 11 key here is the directions:  \"You need the Site 11 key which the kid you saved during the Antlion hunt dropped into the sea.  Go to Phon Coast and at the Hunter's Camp(the area with the gate crystal and all the people) you can find a fallen Bhujerban in the northwest part.  Check the shiny object near him for the key. You can then use the key to open the gate in the W part of Site 9.\"  "},{"steal":"Potion, Reflectga Mote, White Robe","level":"Level 25 -- Recommended 40+","name":"Piscodaemon","strategy":"  Giruvegan\/Gate of Fire  It's the area just before where you fought Tyrant.  I found it to the west   "},{"steal":"Malboro Flower, Foul Liquid, Virgo Gem","level":"Level 25 - - Recommended 45+","name":"Wild Malboro","strategy":"  The Feywood\/Redolent Glade  Same place where you fought Rafflesia   "},{"steal":"Hi-Potion, Beastlord Hide, Gemini Gem","level":"Level 25 - - Recommended 45+","name":"Catoblepas","strategy":"  Zertinan Caverns\/Hourglass Basin  The quickest way is to use the entrance to Zertinan Caverns in the westersands From Invitation to Heresy go SW to Sandfalls.  From Sandfalls go S to the left side of Hourglass Basin. From here go south to The Undershore with a save point.  In this area with the save point look for a hidden path not on the mini-map to the SE between the two sandfalls and then continue up to the other side of Hourglass Basin.   "},{"steal":"Pebble, Hi-Potion, Ring Wyrm Scale","level":"Level 25 - Recommended 60+","name":"Fafnir","strategy":"  Paramina Rift\/Silverflow's End  Fafnir only appears when there is a snowstorm at Silverflow's End however you cannot go through Frozen Brook since that area changes the weather(if you had trouble finding trickster you might have noticed this >_>).  You can force a snowstorm by talking to the client, Relj.  Upon exiting Bur-Omisace to Freezing Gorge head west to Head of the Silverflow and then south to Icebound Flow.  In Icebound Flow take the SE exit to Karydine Glacier and then take the nearby SW exit to Silverflow's End(dead end part).  Try taking a chocobo.  On a sidenote if you need Leshach Entite for anything this is a good opportunity   "},{"steal":"Ring Wyrm Scale, Behemoth Steak, Elixir","level":"Higher Level Strategy:","name":"Behemoth King","strategy":"  The Feywood\/The Edge of Reason  You must kill everything in The Edge of Reason and Icefield of Clearsight and then he will spawn in The Edge of Reason.  This is a pain because you have to kill respawns as well so it often takes several clears of each area before he will spawn.  Snakes are often along the perimeter with a couple in the middle of each area.  The rest are around the structures in each area.  If you are strong enough that you can nearly one-shot or one-shot everything you should be able to clear them without respawns.  Basically kill everything in The Edge of Reason before going to Icefield of Clearsight.  After that move onto Icefield of Clearsight and kill everything.  Once everything is dead return to The Edge of Reason and hopefully you can find mr. behemoth king   "},{"steal":"Tyrant Hide, Tyrant Bone, Hastega Mote","level":"Level 25 - Recommended 60+","name":"Pylraster","strategy":"  Pharos - First Ascent\/They Who Thirst Not  Race Rikken and he will offer to tell you about the hunt at the finish line. Shouldn't matter whether you win or lose.  Teleport to Pharos and take the west exit to They Who Thirst Not and he'll be right in front of you.   "},{"steal":"Storm Crystal, Grimoire Aidhed, Magick Lamp","level":"Level 25 - Recommended 60+","name":"Ixion","strategy":"  Pharos-Subterra  Ixion can appear randomly on any of the subterra floors.  The easiest way to spawn him is to ride the elevator by the gate crystal to Penumbra and back up. You'll know he's spawned when there are no swarming monsters around the ring  If you fight him in the center ring(where you get off the elevator) he'll have the lesser HP total.  Just run around the ring when you find no monsters and he'll eventually teleport to you.  "},{"steal":"Foul Flesh, Maggoty Flesh, Forbidden Flesh","level":"Level 25 - Recommended 60+","name":"Shadowseer","strategy":"  Pharos-Subterra  To access Pharos-Subterra just use a crystal to go to Pharos and take the elevator  There are 3 floors in the Subterra: Penumbra, Umbra and Abyssal.  Each of these floors is a ring with 4 wings.  In each wing you can find a pedestal so 4 for each floor.  The pedestals are in the corner of the first room you enter in each wing(ie the room that is visible on the map).  You must use black orbs on each one till you can't anymore inorder to be able to advance to the next floor.  The shadowseer is on the 4th after Abyssal.  You also must beat Phoenix who is in a hidden room on the first floor to gain access to the seer(Go to the NE room in Penumbra and you can get to it from there).   There is usually a large black orb somewhere on a floor.  If you let the orbs from enemies be they will fly to the orb and be worth 3 times more(they fly in the direction of the large orb).  That's the best thing to do.  After go collect the large black orb for a lot.  You have a choice between using 1, 5 or 10 orbs on a pedestal but don't exceed the amount needed to finish it off or else you'll waste all the orbs you used.  So for example if one needs 9 more and you choose to use 10 then you'll lose those 10 to no effect.  I have the amount for each one on each floor below.  You don't have to do it all in one trip.  You can gather some orbs and go up and save and come back later.  This was a huge pain in the ass to do at a low level till I got used to the enemies and the repetition.  I did sidequests inbetween orb farming.  Magic Pots - Use an elixir on them to make them happy.  Then you can try to steal it back and kill it.  Check out Sephirosuy's Subterra Map for layout and location of magic pots   Ramblings...Subterra really shows you the potential the gameplay in FFXII has.  Lots of enemies, spells being slung around, frantic healing, and so on Unfortunately due to the design choice of going for extremely high quality graphics that the PS2 can barely handle we are stuck with dealing with a spell queue that either leaves you tapping your foot impatiently waiting for some other spell to finish so you can cast something else or swearing up and down.  Very much a shame.  Hopefully they'll learn more quickly than it took Tales Studio and Tri-Ace since it seems FFXIII is gonna be real time as well albeit not the same system as FFXII. (SO1\/2 had high level spells pause the game for flash and in SO3 it's all real time and everything can be cast at the same time though it's not as graphically impressive it's far smoother gameplay.  For the Tales side try playing ToE(ToDIIj) or ToS and trying getting more than one high level spell to execute at the same time...finally in TotA you can do that...mmm triple FoF...)   (If you are at high levels you can ignore the commentary)   Penumbra:  NE: 18 NW: 9 SE: 3 SW: 6,   Total: 36  Inner Ring - It's pointless to fight the enemies that appear here since you get no black orbs. The enemies run around the ring and will end up swarming you. Abaddon's are susceptible to nearly everything such as death, disable, sleep, blind, oil, ect...  Mistmares can be stopped and oiled(and are also weak to fire) and are the worst due to their spell casting.  Warp motes can help clear them out or you can try a fun combo of Sleepga\/Disable + Oil + Firaga will destroy a swarm of them(or AoE spells in general). They can also be blocked(as well as most other enemies here if not all) so having shields is a good idea.  Death also works.  Holy elemental weapons will do a lot of damage.  If you plan to flee through the inner ring to the elevator, another room or whereever turn off your gambits and equip for evasion.  Nothings worse then trying to click something but being constantly interupted by your guys doing other crap.  Also there are Disease traps around.  Rooms -  You'll find Necrofiends, Bunes, Reavers, and dragons.  Bunes and Reavers are susceptible to death as well as other effects like immobilize. In the NW room if you take the west exit there are 4 Bunes which can be very ugly. They have high HP so death is the way to go have your highest magick power guys cast death or simply use Nihopalaoa + phoenix down.  Deathbringers\/Assassin arrows do well as well.  Necrofiends usually appear when an enemy is killed and can confuse so be prepared for that.   Mistwalkers can appear in the first room of each wing but only after a time so becareful fighting near there.  A combination of Mistwalker + Necrofiend(s) + whatever is chemistry for gameover.  You can easily find everyone either disabled or stopped.  This goes for all floors so I won't be repeating it.  Phoenix you can get to by taking the NE door in the center ring.  You can blind it and block.   Umbra:  NE: 15 NW: 9 SE: 15 SW: 18   Total: 57  Inner Ring - Far less chaos than Penumbra.  Dead bones and Mistmares wander around.  They are slower than the damn frogs so it's easier to run from place to place but if you stay in place you'll get swarmed.  Rooms - More dead bones and Necrofiends. You've dealt with Dead Bones in cases like Roblon and such so they shouldn't be a problem.  Only thing is the trick that Necrofiends can appear after killing one.  Again the worst thing that can happen is letting everyone get confused by curse or disabled by hawk glare.  I went through most of the game with Hawk Glare missing 99% of the time but spend enough time down in Subterra and...  Curaja and such is very good to use and can take them out quickly though they can use reflectga.   Abyssal:  NE: 15 NW: 21 SE: 27 SW: 12   Total: 75  Inner Ring - Wandering Dead Bones as well as many that will pop up including Necrofiends.  Things can quickly go bad like on Penumbra.  The traps are status traps which inflict Disable + Reverse, float float.  Rooms - Zombie Warlocks everywhere.  Necrofiends popping up and so on... Same sorta thing as Umbra only a lot more status effects and spells being slung.  Not too bad unless you get sunk by status ailments.  Again Curaja is good though warlocks have lower HP\/defense than most other things here so you can quickly tear through them with regular attacks especially holy type weapons.   Remember you need to kill Phoenix to access the Unknown floor.   As you might have guessed I pretty much just farmed orbs on Penumbra since you can cast death on most things and the rooms don't get out of hand as much at low levels as the other 2.  At high levels the lower floors are better since there are more enemies and hence faster to collect orbs.  "},{"steal":"Holy Stone, Holy Magicite, Holy Crystal","level":"Level 50 - Recommended 75+","name":"Yiazmat","strategy":"                         >   Ridorana Cataract\/Colosseum   <   For Montblanc to offer Yiazmat as a hunt you need to complete all other hunts and defeat Hell Wyrm.    Hell Wyrm  ~9000000 HP  Status - Oil only, Expose\/Shear work  Weak to Holy, Absorbs Dark, Halves the rest  Attacks:  Physical Attack - Chance to cause instant Death Rake - Low CT Stone Breath - Hits all in front, can inflict petrify. -ga spells Judgment - Holy elemental, can inflict Stop Invert - Switches HP and MP  Level 45 - Recommended 55+  First step to hell wyrm is defeating Vyraal which nets you a Dragon Scale. Go back to Cerobi Steppes\/The Northsward(same place where you fought Vyraal) and go to the #10 Windmill and should be able to find an exclamation point. Examine it and you'll meet the Wyrm Philosopher and in exchange for the Dragon Scale will give you the Ageworn key.  The Ageworn key unlocks the door to Hall of the Wroth God in Sochen Cave Palace where Hell Wyrm is.  Enter Sochen Cave Palace from Tchita Uplands and head toward Destiny's March. You want to enter Destiny's March from the east side because you need to open the \"Doors of Hours\" in a specific order.  Open the doors from the east side going SW and then in a clockwise direction all the way around to back to the east where you started and you'll get a message that a door opened. Head to the west side of Destiny's March and you can open the door.  Follow the path to the door to Hall of the Wroth God and use the Ageworn key to open it.  Hell Wyrm is a good introduction to Yiazmat as the fight has similiar mechanics.  First you'll notice that he has more than one health bar with each dot on the bottom bar representing one.  Another difference between it and other foes is that you can leave the room and save and come back later and it won't regenerate health.  It will regenerate health if you stay in it's room without it able to target you though.  White Masks\/Sage Rings are good to absorb Judgment and sage rings are of course great for MP conservation.  Power Armlet's can prevent Judgment's stop (if you're quick you can change your equipment when you see him ready Judgement).  He hits for around 1500 with Maximillian + protect and his spells do similar damage.  Spread out a bit to avoid everyone being hit or simply spam Curaja if you have the MP for it.  For the first 15-25% it mainly just attacks with the occasional rake.  With the instant death chance this can be annoying especially depending on your buff gambits.  Be prepared to edit them.  When I first started Hell Wyrm was insanely lucky with the Instant Death and bleed through my MP till I fixed up my buff gambits.  Judgement is done periodically.  Once you get him down some he'll start using Stone Breath, Spells and invert. This is actually easier.  At around 10 bars left he starts going through different phases.  He starts with spamming rake which can get ugly at low levels(around level 30) since it has instant start up and will demand a fair bit of healing.  Sage rings are very helpful as well as rotating the healing(all you need is curaga) so some people can regen through inquisitor augment(ie attacking).  Like with the phases to come this one lasts until he uses Judgement.  Next phase is stone breath spammage.  Just stay spread out, no problem. If you are using Decoy then you can equip a fuzzy miter on you're tank so you don't have to waste any time curing Petrify.  If not just do it manually so you aren't wasting so much time curing it everytime it's inflicted.  This lasts until he uses Judgement.  Next phase he begins rotating between -ga spells and invert.  Pretty easy as long as you quickly heal whoever gets hit by invert.  If you find gambits are letting you down then do it manually.  If there is anything else beyond this phase I don't know since this where he died at for me.    "}]
